_posts/2015-04-12-php-public.html
---
layout: post
title: PHP 公共函数
author: zrg
comments: false
description: PHP 公共函数
categories:
- PHP
tags:
- PHP
photos:
---

<p>
如果你有任何问题或疑问，请发送Email至zrg1390556487@gmail.com！
</p>

<div id="outline-container-org71300f2" class="outline-2">
<h2 id="org71300f2">写在前面</h2>
<div class="outline-text-2" id="text-org71300f2">
<pre class="example">
关于PHP的一些公共方法

</pre>
</div>
</div>
<div id="outline-container-org26b643e" class="outline-2">
<h2 id="org26b643e">String/Array</h2>
<div class="outline-text-2" id="text-org26b643e">
</div>
<div id="outline-container-orgc43e3b0" class="outline-3">
<h3 id="orgc43e3b0">字符串(String)</h3>
<div class="outline-text-3" id="text-orgc43e3b0">
</div>
<div id="outline-container-orga88aa9c" class="outline-4">
<h4 id="orga88aa9c">常用字符串操作</h4>
<div class="outline-text-4" id="text-orga88aa9c">
<pre class="example">
//字符串长度
$strLength=strlen($str);

</pre>

<pre class="example">
//小写转换为大写
strtoupper($str);
//大写转换为小写
strtolower($str);

</pre>

<pre class="example">
//截取字符串，取出最有一个字符
substr($str,0,-1);

</pre>
</div>
</div>
</div>
<div id="outline-container-orgcbafab6" class="outline-3">
<h3 id="orgcbafab6">数组(Array)</h3>
<div class="outline-text-3" id="text-orgcbafab6">
</div>
<div id="outline-container-org943f033" class="outline-4">
<h4 id="org943f033">常用数组操作</h4>
<div class="outline-text-4" id="text-org943f033">
<pre class="example">
// 字符串转化为数组，explode()
$array=explode(separator,$string);
$pizza = "piece1 piece2 piece3 piece4 piece5 piece6";
$pieces = explode(" ", $pizza);
echo $pieces[0]; // piece1
echo $pieces[1]; // piece2

</pre>

<pre class="example">
// 数组转化为字符串，implode()
$string=implode(glue,$array);

</pre>

<pre class="example">
//去除空元素
array_filter()

</pre>

<pre class="example">
//去除重复元素
array_unique()

</pre>
</div>
</div>
<div id="outline-container-org11a0e27" class="outline-4">
<h4 id="org11a0e27">判断二维数组是否为空</h4>
<div class="outline-text-4" id="text-org11a0e27">
<div class="org-src-container">
<pre class="src src-emacs-lisp">function array_is_null($arr = null){ 
    if(is_array($arr)){ 
        foreach($arr as $k=&gt;$v){ 
            if($v&amp;&amp;!is_array($v)){ 
                return false<span style="color: #5f615c; font-style: italic;">; </span>
            }
            $t = self::array_is_null($v)<span style="color: #5f615c; font-style: italic;">; </span>
            if(!$t){ 
                return false<span style="color: #5f615c; font-style: italic;">; </span>
            } 
        }
        return true<span style="color: #5f615c; font-style: italic;">; </span>
    }elseif(!$arr){ 
        return true<span style="color: #5f615c; font-style: italic;">; </span>
    }else{ 
        return false<span style="color: #5f615c; font-style: italic;">; </span>
    }
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf2a9b54" class="outline-2">
<h2 id="orgf2a9b54">Date/Time</h2>
<div class="outline-text-2" id="text-orgf2a9b54">
</div>
<div id="outline-container-orge14be86" class="outline-3">
<h3 id="orge14be86">获取当月天数及当月第一天及最后一天、上月第一天及最后一天</h3>
<div class="outline-text-3" id="text-orge14be86">
</div>
<div id="outline-container-org60fdc30" class="outline-4">
<h4 id="org60fdc30">获取上个月第一天及最后一天</h4>
<div class="outline-text-4" id="text-org60fdc30">
<pre class="example">
echo date('Y-m-01', strtotime('-1 month'));
echo date('Y-m-t', strtotime('-1 month'));

</pre>

<pre class="example">
//上个月第一天:
echo date('Y-m-d', strtotime(date('Y-m-01') . ' -1 month')); // 计算出本月第一天再减一个月
//上个月最后一天:
echo date('Y-m-d', strtotime(date('Y-m-01') . ' -1 day')); // 计算出本月第一天再减一天

</pre>
</div>
</div>
<div id="outline-container-org3ba6b0b" class="outline-4">
<h4 id="org3ba6b0b">获取当月第一天及最后一天</h4>
<div class="outline-text-4" id="text-org3ba6b0b">
<pre class="example">
$BeginDate=date('Y-m-01', strtotime(date("Y-m-d")));
echo date('Y-m-d', strtotime("$BeginDate +1 month -1 day"));

</pre>
</div>
</div>
<div id="outline-container-orgeadd693" class="outline-4">
<h4 id="orgeadd693">获取当前年份、月份、日、天数</h4>
<div class="outline-text-4" id="text-orgeadd693">
<pre class="example">
echo " 本月共有:".date("t")."天";
echo " 当前年份".date('Y');
echo " 当前月份".date('m');
echo " 当前几号".date('d');

</pre>
</div>
</div>
</div>
<div id="outline-container-org06cb4f7" class="outline-3">
<h3 id="org06cb4f7">日期转时间戳，时间戳转日期</h3>
<div class="outline-text-3" id="text-org06cb4f7">
<pre class="example">
strtotime('2010-03-24 08:15:42');
date('Y-m-d H:i:s', 1156219870);

</pre>
</div>
</div>
</div>
